In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# File with median incomes and location, from 2005 - 2019

df = pd.read_excel(r"C:\Users\sandr\OneDrive\Desktop\Metis\DS_Engineering\1_Exploratory Data Analysis\nyc_median_incomes.xlsx")
# df = df[['Location', 'TimeFrame', 'DataFormat', 'Data']]

# Take a look at the datatypes
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6068 entries, 0 to 6067
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Location        6068 non-null   object
 1   Household Type  6068 non-null   object
 2   TimeFrame       6068 non-null   int64
 3   DataFormat      6068 non-null   object
 4   Data            6064 non-null   float64
 5   Fips            6068 non-null   int64
dtypes: float64(1), int64(2), object(3)
memory usage: 284.6+ KB

In [3]:
# Take a look at the first few rows
df.head()

  Location             Household Type  TimeFrame DataFormat         Data  Fips
0  Astoria  Families without Children       2019    Dollars  92755.00000   401
1  Astoria     Families with Children       2019    Dollars  75972.00000   401
2  Astoria                   Families       2019    Dollars  88662.00000   401
3  Astoria             All Households       2019    Dollars  79180.00000   401
4  Astoria  Families without Children       2018    Dollars  79374.50784   401

In [4]:
# Look at column names
df.columns

Index(['Location', 'Household Type', 'TimeFrame', 'DataFormat', 'Data',
       'Fips'],
      dtype='object')

In [5]:
# How many rows and columsn does the dataset have?
df.shape

(6068, 6)

In [6]:
# Identify which columns have null values

null_counts = df.isnull().sum()
null_counts[null_counts > 0].sort_values(ascending=False)

Data    4
dtype: int64

In [7]:
# Identify the rows with null values

df_null = df[df.isnull().any(axis=1)]
df_null

,Location,Household Type,TimeFrame,DataFormat,Data,Fips
102,Battery Park/Tribeca,Families with Children,2015,Dollars,NaN,101
1697,Greenwich Village,Families with Children,2015,Dollars,NaN,102
2357,Murray Hill/Stuyvesant,Families with Children,2015,Dollars,NaN,106
3573,Upper East Side,Families with Children,2011,Dollars,NaN,108

In [8]:
# Remove rows with null values

df = df.dropna()

# verify no null values
df.isnull().sum()

Location          0
Household Type    0
TimeFrame         0
DataFormat        0
Data              0
Fips              0
dtype: int64

In [9]:
# Remove unncessary columns - 'Data Format' and eventually 'TimeFrame
# df.groupby(['Location', 'TimeFrame'])
# df.head()

In [10]:
# Find the range of the TimeFrame
year = df.TimeFrame
min_year = year.min()
max_year = year.max()
print(f"The time frame for this dataset ranges from {min_year} to {max_year}")

The time frame for this dataset ranges from 2005 to 2019

In [11]:
# Use only relevant columns for data
df = df[['Location', 'Data']]
df

            Location         Data
0            Astoria  92755.00000
1            Astoria  75972.00000
2            Astoria  88662.00000
3            Astoria  79180.00000
4            Astoria  79374.50784
...              ...          ...
6063  Zip Code 10474  22568.09834
6064  Zip Code 10454  22466.93352
6065  Zip Code 10454  21532.17550
6066  Zip Code 10454  21447.00000
6067  Zip Code 10474  20114.00000

[6064 rows x 2 columns]

In [ ]:
# List median income in descending order

df_highest = df.groupby('Location').median('Data').reset_index().sort_values(by='Data', ascending=False)
df_highest

In [ ]:
# Remove the "zip code"

def get_zip(location):
    zip_code = []
    if location[:8] == 'Zip Code':
        zip_code.append(location[9:])
    return zip_code
        
    
result = df['Location'].apply(get_zip)
result

In [ ]:
# Find the median income for each location

df_lowest = df.groupby('Location').median('Data').reset_index().sort_values(by='Data')
df_lowest.head(10)

###  5 Lowest Median Income Locations in NYC

### Are located in the Bronx

In [ ]:
# Only view the 5 lowest median income areas by Zip Codes

low_5 = df.loc[df['Location'].isin(["Zip Code 10454", "Zip Code 10455", "Zip Code 10460", "Zip Code 10453", "Zip Code 10474"])]
low_5_median = low_5.groupby('Location').median().reset_index().sort_values(by='Data')
low_5_median

In [ ]:
# Find the mean
low_5_mean = low_5.groupby('Location').mean().reset_index().sort_values(by='Data')
low_5_mean

## Visualizations

In [ ]:
# Plot mean incomes

plt.xticks(rotation=45)
plt.ylabel("Dollars")
plt.title("Lowest Mean Incomes in the Bronx", size=20, fontweight="bold")

plt.ylim(24000,33000)

values = low_5_mean['Data']
names = low_5_mean['Location']

plt.bar(names, values, alpha=0.2)

In [ ]:
# Plot median incomes

plt.xticks(rotation=45)
plt.ylabel("Dollars")
plt.title("Lowest Median Incomes in the Bronx", size=20, fontweight="bold")

plt.ylim(24000,31000)

values = low_5_median['Data']
names = low_5_median['Location']

plt.bar(names, values)

In [ ]:
# Plot the mean incomes against the median incomes

mean = low_5_mean['Data']
median = low_5_median['Data']
zips = low_5_mean['Location']

plt.ylim(24000,33000)

plt.plot(zips, mean)
plt.plot(zips, median)

plt.title('Mean Income vs Median Income', fontweight='bold', size=18)
plt.xticks(rotation=45)
plt.ylabel("Dollars")

plt.legend(['Mean Income', 'Median Income'], loc='lower right')

In [ ]:
# Plot a boxplot of lowest 5 income areas

values = low_5['Data']
names = low_5['Location']

plt.ylim(20000,47000)

sns.boxplot(x=names,y=values)

plt.xticks(rotation=45)
plt.ylabel("Dollars")

plt.title('Income of Bottom 5 Zip Codes', fontweight='bold', size=17)

sns.despine()